month = input()
hours_spent = int(input())
people = int(input())
time_of_day = input()

price = 0

if month == 'march' or month == 'april' or month == 'may':
    if time_of_day == 'day':
        price = 10.50
    elif time_of_day == 'night':
        price = 8.40
elif month == 'june' or month == 'july' or month == 'august':
    if time_of_day == 'day':
        price = 12.60
    elif time_of_day == 'night':
        price = 10.20

if people >= 4:
    price *= 0.90

if hours_spent >= 5:
    price *= 0.50

total_price = price * people * hours_spent

print(f'Price per person for one hour: {price:.2f}')
print(f'Total cost of the visit: {total_price:.2f}')


# В най-голямата компютърна зала в България цените варират поради голямата посещаемост. Таксите на залата
# са в зависимост от това дали е ден или нощ, както и месецът, в който се посещава залата. Цените са
# следните:
# Март до Май Юни до Август
# Ден 10.50 лв/ч 12.60 лв/ч
# Нощ 8.40 лв/ч 10.20 лв/ч
# Предлагат се и следните отстъпки в следната последователност:
# • За група от четирима или повече човека, цената на човек се намаля с 10%
# • За 5 или повече часа прекарани, цената на човек се намаля с 50%
# Да се напише програма, която изчислява цената на човек за час и общата сума.
# Вход:
# Входът се чете от конзолата и съдържа точно 4 реда:
# • На първия ред - месецът - текст с възможности: "march", "april", "may", "june", "july", "august"
# • На втория ред - броят на прекараните часове - цяло число в диапазона [1...10]
# • На третия ред - броят на хората в групата - цяло число в диапазона [1...10]
# • На четвъртия ред - времето от деня – текст с възможности: "day" или "night"
# Изход:
# Да се отпечатат на конзолата 2 реда:
# • На първия ред: "Price per person for one hour: {цена на човек за час}"
# • На втория ред: "Total cost of the visit: {общата цена}"
# Цените да бъдат форматирани до втория знак след десетичната запетая.