from math import floor

tournaments = int(input())
starting_points = int(input())
# stage = str(input())
score = 0
wins = 0

for _ in range(tournaments):
    competitions = str(input())

    if competitions == "W":
        score += 2000
        wins += 1
    elif competitions == "F":
        score += 1200
    elif competitions == "SF":
        score += 720

print(f"Final points: {starting_points + score}")
print(f"Average points: {floor(score / tournaments)}")
print(f"{wins / tournaments * 100:.2f}%")
# Григор Димитров е тенисист, чиято следваща цел е изкачването в световната ранглиста по тенис за мъже.
# През годината Гришо участва в определен брой турнири, като за всеки турнир получава точки, които зависят от /
# позицията, на която е завършил в турнира. Има три варианта за завършване на турнир:
#     • W - ако е победител получава 2000 точки
#     • F - ако е финалист получава 1200 точки
#     • SF - ако е полуфиналист получава 720 точки
# Напишете програма, която изчислява колко ще са точките на Григор след изиграване на всички турнири, като знаете /
# с колко точки стартира сезона. Също изчислете колко точки средно печели от всички изиграни турнири и колко процента/
# от турнирите е спечелил.
# '''Вход
# От конзолата първо се четат два реда:
#     • Брой турнири, в които е участвал – цяло число в интервала [1…20] 
#     • Начален брой точки в ранглистата - цяло число в интервала [1...4000]
'''
# За всеки турнир се прочита отделен ред:
#     • Достигнат етап от турнира – текст – "W", "F" или "SF"
# Изход
# Отпечатват се три реда в следния формат:
#     • "Final points: {брой точки след изиграните турнири}"
#     • "Average points: {средно колко точки печели за турнир}"
#     • "{процент спечелени турнири}%"
# Средните точки да бъдат закръглени към най-близкото цяло число надолу, а процентът да се форматира до втората цифра след десетичния знак.'''