one_lev = int(input())
two_leva = int(input())
five_leva = int(input())
price = int(input())

initial_price = price

for one in range(one_lev + 1):
    for two in range(two_leva + 1):
        for five in range(five_leva + 1):
            if (one * 1) + (two * 2) + (five * 5) == price:
                print(f'{one} * 1 lv. + {two} * 2 lv. + {five} * 5 lv. = {price} lv.')
                price = initial_price

# Имаме банкноти и монети по 1лв., по 2лв. и по 5лв. Да се напише програма, която прочита въведените от потребителя /
# брой банкноти и монети и сума, и извежда на екран всички възможни начини по които сумата може да се изплати с /
# наличните банкноти.
# Вход
# Входът се чете от конзолата и съдържа точно 4 реда:
#     1. Брой монети по 1лв. - цяло положително число;
#     2. Брой монети по 2лв. - цяло положително число;
#     3. Брой банкноти по 5лв. - цяло положително число;
#     4. Сума - цяло положително число в интервала [1…1000];
# Изход
# Да се отпечатат на конзолата всички комбинации от дадените номинали, образуващи сумата, форматирани по следния начин:
#     • "{бр. 1лв.} * 1 lv. + {бр. 2лв.} * 2 lv. + {бр. 5лв.} * 5 lv. = {сума} lv."