start_of_range = int(input())
end_of_range = int(input())
magic_number = int(input())

combination = 0
counter = 0
for i in range(start_of_range, end_of_range + 1):
    for k in range(start_of_range, end_of_range + 1):
        combination = i + k
        counter += 1
        if combination == magic_number:
            print(f'Combination N:{counter} ({i} + {k} = {magic_number})')
            raise SystemExit

if combination != magic_number:
    print(f'{counter} combinations - neither equals {magic_number}')

# Напишете програма която проверява всички възможни комбинации от двойка числа в интервала от две дадени числа./
# На изхода се отпечатва, коя поред е комбинацията чиито сбор от числата е равен на дадено магическо число. /
# Ако няма нито една комбинация отговаряща на условието се печата съобщение, че не е намерено.
# Вход
# Входът се чете от конзолата и се състои от три реда:
#     • Първи ред – начало на интервала – цяло число в интервала [1...999]
#     • Втори ред – край на интервала – цяло число в интервала [по-голямо от първото число...1000]
#     • Трети ред – магическото число – цяло число в интервала [1...10000]
# Изход
# На конзолата трябва да се отпечата един ред, според резултата:
#     • Ако е намерена комбинация чиито сбор на числата е равен на магическото число
#         ◦ "Combination N:{пореден номер} ({първото число} + {второ число} = {магическото число})"
#     • Ако не е намерена комбинация отговаряща на условието
#         ◦ "{броят на всички комбинации} combinations - neither equals {магическото число}"