number = input() # input is string

a = int(number[0]) # take the integer at index 0
b = int(number[1]) # take the int at index 1
c = int(number[2]) # take the int at index 2

for d in range(1, c + 1):
    for e in range(1, b + 1):
        for f in range(1, a + 1):
            result = int(d) * int(e) * int(f)
            print(f'{d} * {e} * {f} = {result};')

# Най-малкият син на семейство Иванови все още не знае таблицата за умножение. Веднага след коледните
# празници, той ще има контролно и вие трябва да му помогнете да я научи. Вашата задача е да съставите
# програма, в която се въвежда цяло трицифрено число и се извежда таблицата за умножение. Поради
# особености на Вашата програма, тя взима цифрите на въведеното число в обратен ред. Максималната
# стойност на множителите е определена от всяка една от 3-те цифри на въведеното число.
# Вход
# Входът е цяло трицифрено число в интервала [111...999].
# Изход
# Да се отпечатат на конзолата няколко на брой реда в следния формат:
# "{първата цифра} * {втората цифра} * {третата цифра} = {резултатът от умножението на
# трите цифри};"
# Първата, втората и третата цифра не могат да бъдат отрицателни числа или равни на 0!