men = int(input())
women = int(input())
tables = int(input())

while True:
    meetings = 0
    for man in range(1, men + 1):
        if meetings >= tables:
            break
        for woman in range(1, women + 1):
            print(f'({man} <-> {woman})', end=' ')
            meetings += 1
            if meetings >= tables:
                break
    break
# Провокирани от сватбата си, Михаела и Иван решават да предоставят нова услуга на клиенти на ресторанта си, а/
# именно вечеря за запознанства - "Предизвикай Сватбата". Напишете програма, която отпечатва всички възможни срещи /
# на клиентите на ресторанта. При настаняване всеки мъж и всяка жена получават талончета с поредни номера стартирайки /
# от 1. Ако бъдат заети всички маси, програмата трябва да приключи. Всяка маса има две места.
# Вход
# От конзолата се четат точно 3 числа, всяко на отделен ред:
#     • Броя клиенти мъже - цяло число в интервала [1...100]
#     • Броя клиенти жени - цяло число в интервала [1...100]
#     • Максималният брой маси - цяло число в интервала [1...100]
# Изход
# На конзолата се принтират на един ред, разделени с интервал всички срещи в следният формат:
#     • ({№ клиент} <-> {№ клиент}) ({№ клиент} <-> {№ клиент}) ...