first_number = int(input())
second_number = int(input())
third_number = int(input())

for i in range(1, first_number + 1):
    for j in range(2, second_number + 1):
        for k in range(1, third_number + 1):
            if i % 2 == 0 and k % 2 == 0:
                if j == 2 or j == 3 or j == 5 or j == 7:
                    print(i, j, k)




# Да се напише програма, която генерира трицифрени PIN кодове, като цифрите на всеки PIN код са в определен интервал./
# За да бъде валиден един PIN код той трябва да отговаря на следните условия:
#     • Първата и третата цифра трябва да бъдат четни.
#     • Втората цифра трябва да бъде просто число в диапазона [2...7].
# Вход
# От конзолата се четат 3 реда:
#     • Горната граница на първото число - цяло число в диапазона [1...9]
#     • Горната граница на второто число - цяло число в диапазона [1...9]
#     • Горната граница на третото число - цяло число в диапазона [1...9]
# Изход
# Да се отпечатат на конзолата всички валидни трицифрени PIN кодове, чиито цифри отговарят на съответните интервали.